MPS/src/Catalogs/ТочкиСценарияРазделение/ТочкиСценарияРазделение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТочкиСценарияРазделение</name>
  <owners>Catalog.Сценарии</owners>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НаправлениеРазделения</name>
    <attributes>
      <name>Направление</name>
      <type>
        <types>DefinedType.ТочкиСценария</types>
      </type>
    </attributes>
    <attributes>
      <name>Вероятность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

MPS/src/Catalogs/ТочкиСценарияРазделение/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ИДСвязиПриСоздании") Тогда
		ИДСвязиПриСоздании = Параметры.ИДСвязиПриСоздании;
	КонецЕсли;	
	
	Точки = Неопределено;
	Если Параметры.Свойство("Точки", Точки) Тогда
		//удаление точек, не найденных в ГС как потомки разделения
		КУдалению = Новый Массив;
		Для каждого СтрокаНаправления из Объект.НаправлениеРазделения Цикл
			Если Точки.Найти(СтрокаНаправления.Направление) = Неопределено Тогда
				КУдалению.Добавить(СтрокаНаправления);
			КонецЕсли;	
		КонецЦИкла;	
		Для каждого СтрокаКУдалению из КУдалению Цикл
			Объект.НаправлениеРазделения.Удалить(СтрокаКУдалению);
		КонецЦикла;
		
		//добавление точек, котрых нет в тч
		Для каждого Точка из Точки Цикл
			Строки = Объект.НаправлениеРазделения.НайтиСтроки(НОвый Структура("Направление",Точка ));
			Если Строки.Количество() = 0 Тогда
				Объект.НаправлениеРазделения.Добавить().Направление = Точка;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ЗаписьТочкиСценария",ИДСвязиПриСоздании,Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЕстьДублиНаправленийРазделения() Тогда
		Отказ = Истина;
		ТекстОповещения = НСтр("ru = 'Обнаружены строки с одинаковым направлением. Нажмите, чтобы свернуть дубли.'");
		ПояснениеОповещения = НСтр("ru = 'Свернуть дубли по направлению'");
		ОповещениеОСворачивании = Новый ОписаниеОповещения("СвернутьДублиНаправленийЗавершение", ЭтотОбъект);
		ПоказатьОповещениеПользователя(ТекстОповещения, ОповещениеОСворачивании, ПояснениеОповещения);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ДублиНаправлений
&НаКлиенте
Функция ЕстьДублиНаправленийРазделения()
	ВстреченныеНаправления = Новый Соответствие;
	Для Каждого СтрокаРазделения Из Объект.НаправлениеРазделения Цикл
		Если СтрокаРазделения.Направление = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ВстреченныеНаправления.Получить(СтрокаРазделения.Направление) = Неопределено Тогда
			ВстреченныеНаправления.Вставить(СтрокаРазделения.Направление, Истина);
		Иначе
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура СвернутьДублиНаправленийЗавершение(ДополнительныеПараметры) Экспорт
	СвернутьДублиНаправленийРазделения();
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДублиНаправленийРазделения()
	СтрокиПоНаправлениям = Новый Соответствие;
	УдаляемыеСтроки = Новый Массив;
	Для Каждого СтрокаРазделения Из Объект.НаправлениеРазделения Цикл
		Если СтрокаРазделения.Направление = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СвернутаяСтрока = СтрокиПоНаправлениям.Получить(СтрокаРазделения.Направление);
		Если СвернутаяСтрока = Неопределено Тогда
			СтрокиПоНаправлениям.Вставить(СтрокаРазделения.Направление, СтрокаРазделения);
		Иначе
			СвернутаяСтрока.Вероятность = СвернутаяСтрока.Вероятность + СтрокаРазделения.Вероятность;
			УдаляемыеСтроки.Добавить(СтрокаРазделения);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаРазделения Из УдаляемыеСтроки Цикл
		Объект.НаправлениеРазделения.Удалить(СтрокаРазделения);
	КонецЦикла;
КонецПроцедуры
#КонецОбласти


&НаКлиенте
Процедура НаправлениеРазделенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
//	Если Объект.НаправлениеРазделения.Количество() = 2 Тогда
//			Сообщение = НОвый СообщениеПользователю;
//			Сообщение.Текст = НСтр("ru = 'Максимальное количество направлений - 2.'");
//			Сообщение.Сообщить();
//			Отказ = Истина;
//	КонецЕсли;
КонецПроцедуры
